whiteb3ar/hoverboard-firmware-hack-FOC/Src/Platform/Stm32/setup.c
/*
 * This file is part of the hoverboard-firmware-hack project.
 *
 * Copyright (C) 2017-2018 Rene Hopf <renehopf@mac.com>
 * Copyright (C) 2017-2018 Nico Stute <crinq@crinq.de>
 * Copyright (C) 2017-2018 Niklas Fauth <niklas.fauth@kit.fail>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/*
tim1 master, enable -> trgo
tim8, gated slave mode, trgo by tim1 trgo. overflow -> trgo
adc1,adc2 triggered by tim8 trgo
adc 1,2 dual mode

ADC1             ADC2
R_Blau PC4 CH14  R_Gelb PC5 CH15
L_Grün PA0 CH01  L_Blau PC3 CH13
R_DC PC1 CH11    L_DC PC0 CH10
BAT   PC2 CH12   L_TX PA2 CH02
BAT   PC2 CH12   L_RX PA3 CH03

pb10 usart3 dma1 channel2/3
*/

#include "defines.h"
#include "config.h"
#include "setup.h"
#include "app.h"

#include "stm32f1xx_hal.h"
#include "eeprom.h"

TIM_HandleTypeDef htim_right;
TIM_HandleTypeDef htim_left;
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
I2C_HandleTypeDef hi2c2;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_usart3_rx;
DMA_HandleTypeDef hdma_usart3_tx;

volatile adc_buf_t adc_buffer;

void SystemClock_Config(void);
void UART_DisableRxErrors(UART_HandleTypeDef *huart);

void hardware_init(void);
void activate_latch();
void light_led();
void start_adc();
int is_button_pressed();
int is_uart3_available(void);
void uart3_transmit(uint8_t *data, int size);
void reset(void);

void init_eeprom(void);
void read_configuration(uint16_t *buffer);
void read_configuration_value(uint16_t address, uint16_t *value);

void uart2_putchar(char *data)
{
  HAL_UART_Transmit(&huart2, (uint8_t *)data, 1, 1000);
}

void uart3_putchar(char *data)
{
  HAL_UART_Transmit(&huart3, (uint8_t *)data, 1, 1000);
}

void unit_uart2_dma(uint8_t *buffer, int size)
{
  HAL_UART_Receive_DMA(&huart2, buffer, size);
  UART_DisableRxErrors(&huart2);
}

void unit_uart3_dma(uint8_t *buffer, int size)
{
  HAL_UART_Receive_DMA(&huart2, buffer, size);
  UART_DisableRxErrors(&huart3);
}

void set_left_motor_disabled(uint8_t disabled)
{
  if (disabled)
  {
    LEFT_TIM->BDTR &= ~TIM_BDTR_MOE;
  }
  else
  {
    LEFT_TIM->BDTR |= TIM_BDTR_MOE;
  }
}

void read_left_motor_hall(uint8_t *values)
{
  values[0] = !(LEFT_HALL_U_PORT->IDR & LEFT_HALL_U_PIN);
  values[1] = !(LEFT_HALL_V_PORT->IDR & LEFT_HALL_V_PIN);
  values[2] = !(LEFT_HALL_W_PORT->IDR & LEFT_HALL_W_PIN);
}

void set_left_motor_pwm(uint16_t u, uint16_t v, uint16_t w)
{
  LEFT_TIM->LEFT_TIM_U = u;
  LEFT_TIM->LEFT_TIM_V = v;
  LEFT_TIM->LEFT_TIM_W = w;
}

void set_right_motor_disabled(uint8_t disabled)
{
  if (disabled)
  {
    RIGHT_TIM->BDTR &= ~TIM_BDTR_MOE;
  }
  else
  {
    RIGHT_TIM->BDTR |= TIM_BDTR_MOE;
  }
}

void read_right_motor_hall(uint8_t *values)
{
  values[0] = !(RIGHT_HALL_U_PORT->IDR & RIGHT_HALL_U_PIN);
  values[1] = !(RIGHT_HALL_V_PORT->IDR & RIGHT_HALL_V_PIN);
  values[2] = !(RIGHT_HALL_W_PORT->IDR & RIGHT_HALL_W_PIN);
}

void set_right_motor_pwm(uint16_t u, uint16_t v, uint16_t w)
{
  RIGHT_TIM->RIGHT_TIM_U = u;
  RIGHT_TIM->RIGHT_TIM_V = v;
  RIGHT_TIM->RIGHT_TIM_W = w;
}

void toggle_buzzer()
{
  HAL_GPIO_TogglePin(BUZZER_PORT, BUZZER_PIN);
}

void switch_buzzer_off()
{
  HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_RESET);
}

Motor motor_left = {
    .read_hall = read_left_motor_hall,
    .set_disabled = set_left_motor_disabled,
    .set_pwm = set_left_motor_pwm};

Motor motor_right = {
    .read_hall = read_right_motor_hall,
    .set_disabled = set_right_motor_disabled,
    .set_pwm = set_right_motor_pwm};

Logger logger = {
    .uart2_putchar = uart2_putchar,
    .uart3_putchar = uart3_putchar};

Hardware hardware = {
    .activate_latch = activate_latch,
    .hardware_init = hardware_init,
    .is_button_pressed = is_button_pressed,
    .light_led = light_led,
    .start_adc = start_adc,
    .is_uart3_available = is_uart3_available,
    .uart3_transmit = uart3_transmit,
    .unit_uart2_dma = unit_uart2_dma,
    .unit_uart3_dma = unit_uart3_dma,

    .init_eeprom = init_eeprom,
    .read_configuration = read_configuration,
    .read_configuration_value = read_configuration_value,

    .reset = reset};

void init_eeprom(void)
{
  HAL_FLASH_Unlock();
  EE_Init();
  HAL_FLASH_Lock();
}

void read_configuration_value(uint16_t address, uint16_t *value)
{
  HAL_FLASH_Unlock();
  EE_ReadVariable(address, value);
  HAL_FLASH_Lock();
}

void read_configuration(uint16_t *configuration)
{
  HAL_FLASH_Unlock();

  for (uint8_t i = 0; i < NB_OF_VAR; i++)
  {
    EE_ReadVariable(VirtAddVarTab[i], &configuration[i]);
  }

  HAL_FLASH_Lock();
}

void write_configuration(uint16_t *configuration)
{
  HAL_FLASH_Unlock();

  for (uint8_t i = 0; i < NB_OF_VAR; i++)
  {
    EE_WriteVariable(VirtAddVarTab[i], configuration[i]);
  }

  HAL_FLASH_Lock();
}

int is_uart3_available(void)
{
  return __HAL_DMA_GET_COUNTER(huart3.hdmatx) == 0;
}

void uart3_transmit(uint8_t *data, int size)
{
  HAL_UART_Transmit_DMA(&huart3, data, size);
}

void hardware_init(void)
{
  HAL_Init();

  __HAL_RCC_AFIO_CLK_ENABLE();
  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
  /* System interrupt init*/
  /* MemoryManagement_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(MemoryManagement_IRQn, 0, 0);
  /* BusFault_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(BusFault_IRQn, 0, 0);
  /* UsageFault_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(UsageFault_IRQn, 0, 0);
  /* SVCall_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SVCall_IRQn, 0, 0);
  /* DebugMonitor_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DebugMonitor_IRQn, 0, 0);
  /* PendSV_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(PendSV_IRQn, 0, 0);
  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

  SystemClock_Config();

  __HAL_RCC_DMA1_CLK_DISABLE();

